org/projects.org
#+Title: Projects
#+Author: Ewan Townshend
#+Options: toc:3 num:nil

* [[https://github.com/ewantown/nice-org-html][nice-org-html]]
This is an Emacs package (available on [[https://melpa.org/#/nice-org-html][Melpa]]) that generates pretty static websites from [[https://orgmode.org/guide/Markup.html][Org Mode markup]] files and user-chosen Emacs themes. Emacs has a built-in mechanism for exporting .org files and publishing projects comprised of linked .org files, but this mechanism generates very basic HTML, with an outdated appearance when rendered in the browser. This package addresses that shortcoming, in part by leveraging the variety of open-source themes available for Emacs, and in part by using schematic s-expressions to complete HTML component templates. The package provides an Org Export backend, a publishing function, and a publishing-function-generating macro, which enable users to customize the look-and-feel of generated web pages by just specifying values for parameters. This package is used, together with the built-in [[https://www.gnu.org/software/emacs/manual/html_node/org/Publishing.html][publisher]], to generate the website you are viewing now. Customization is achieved by a single macro call:

#+begin_src emacs-lisp
  (nice-org-html-publishing-function
   :theme-alist
   ((dark . spacemacs-dark) (light . spacemacs-light))
   :default-mode dark
   :headline-bullets (:h1 "" :h2 "" :h3 "▷" :h4 "" :h5 "")
   :header
   (("Ewan Townshend" . "home")
    ("About" . "about")
    ("Projects" . "projects")
    ("Thoughts" . "thoughts"))
   :footer
   (("© 2025" . nil)
    ("LinkedIn" . "https://www.linkedin.com/in/ewan-townshend")
    ("GitHub" . "https://github.com/ewantown")
    ("Resumé" . "other/sw-resume.pdf")
    ("Email" . "mailto:ewan@etown.dev")))
#+end_src

