site/projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Projects</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="preamble" class="status">
<div id='generated-header' class='generated'><header>
 <nav>
<a class='nav-title'href='home' >
Ewan Townshend
</a>
<input id='nav-toggle-top' class='nav-toggle' type='checkbox'>
<label class='nav-button' for='nav-toggle-top'><span/></label>
<div class='separator menu-sep'></div>
<ul class='nav-list'>
<li class='nav-item'>
<a class='nav-link' href='about'>
About</a>
</li>
<li class='nav-item'>
<a class='nav-link' href='projects'>
Projects</a>
</li>
<li class='nav-item'>
<a class='nav-link' href='thoughts'>
Thoughts</a>
</li>
</ul>
<div class='separator'></div>
</nav>
</header>
</div>
<div id='view-controls'><div id='toggle-mode' title='Mode'>&#9788;</div><div id='goto-top' title='Top'>&#8963;</div><div id='toggle-toc' title='Contents'>&#9776;</div></div>
</div>
<div id="content" class="content">
<h1 class="title">Projects</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e5f0b9">nice-org-html</a></li>
<li><a href="#org678d946">M-&lambda;</a></li>
<li><a href="#org1885f40">Guiser</a></li>
<li><a href="#org0f46220">search-factory</a></li>
<li><a href="#org98abe61">LifeInteractive</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0e5f0b9" class="outline-2">
<h2 id="org0e5f0b9"><a href="https://github.com/ewantown/nice-org-html">nice-org-html</a></h2>
<div class="outline-text-2" id="text-org0e5f0b9">
<p>
This is an Emacs package (available on <a href="https://melpa.org/#/nice-org-html">Melpa</a>) that generates pretty static websites from <a href="https://orgmode.org/guide/Markup.html">Org Mode markup</a> files and user-chosen Emacs themes. Emacs has a built-in mechanism for exporting .org files and publishing projects comprised of linked .org files, but this mechanism generates very basic HTML, with an outdated appearance when rendered in the browser. This package addresses that shortcoming, in part by leveraging the variety of open-source themes available for Emacs, and in part by using schematic s-expressions to complete HTML component templates. The package provides an Org Export backend, a publishing function, and a publishing-function-generating macro, which enable users to customize the look-and-feel of generated web pages by just specifying values for parameters. This package is used, together with the built-in <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Publishing.html">publisher</a>, to generate the website you are viewing now. Customization is achieved by a single macro call:
</p>

<div class='org-src-wrapper'>
<div class='org-src-bar'><span class='srcLangLabel'>EMACS-LISP</span><button class='copyBtn' name=btn_0da3b73d2f8540288faa99423a811ec1>&#10697;</button>
<script type='text/javascript'>
var copyBtnbtn_0da3b73d2f8540288faa99423a811ec1=document.querySelector('button[name=btn_0da3b73d2f8540288faa99423a811ec1]');
copyBtnbtn_0da3b73d2f8540288faa99423a811ec1.addEventListener('click', function(event) {
let res = copyTextToClipboard(`(nice-org-html-publishing-function\n :theme-alist\n ((dark . spacemacs-dark) (light . spacemacs-light))\n :default-mode dark\n :headline-bullets (:h1 \"\" :h2 \"\" :h3 \"▷\" :h4 \"\" :h5 \"\")\n :header\n ((\"Ewan Townshend\" . \"home\")\n  (\"About\" . \"about\")\n  (\"Projects\" . \"projects\")\n  (\"Thoughts\" . \"thoughts\"))\n :footer\n ((\"© 2025\" . nil)				\n  (\"LinkedIn\" . \"https://www.linkedin.com/in/ewan-townshend\")\n  (\"GitHub\" . \"https://github.com/ewantown\")\n  (\"Resumé\" . \"other/sw-resume.pdf\")\n  (\"Email\" . \"mailto:ewan@etown.dev\")))\n`);copyBtnbtn_0da3b73d2f8540288faa99423a811ec1.innerHTML = res ? '&#10003;' : 'error';setTimeout(() => { copyBtnbtn_0da3b73d2f8540288faa99423a811ec1.innerHTML = '&#10697;'}, 3000);
});
</script>
</div><div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">nice-org-html-publishing-function</span>
 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:theme-alist</span>
 ((dark . spacemacs-dark) (light . spacemacs-light))
 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:default-mode</span> dark
 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:headline-bullets</span> (<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:h1</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:h2</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:h3</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#9655;"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:h4</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:h5</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span>)
 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:header</span>
 ((<span style="color: var(--clr-string); background-color: var(--bg-string);">"Ewan Townshend"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"home"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"About"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"about"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Projects"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"projects"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Thoughts"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"thoughts"</span>))
 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:footer</span>
 ((<span style="color: var(--clr-string); background-color: var(--bg-string);">"&#169; 2025"</span> . nil)                              
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"LinkedIn"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"https://www.linkedin.com/in/ewan-townshend"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"GitHub"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"https://github.com/ewantown"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Resum&#233;"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"other/sw-resume.pdf"</span>)
  (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Email"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"mailto:ewan@etown.dev"</span>)))
</pre>
</div></div>
</div>
</div>
